import streamlit as st

st.set_page_config(page_title="開発の背景", page_icon="🔎")

st.header("アプリ開発の背景")

st.info("ここにはぽいネ！開発に至った背景が書かれています")

st.markdown("""
## その1　コミュニケーションを促進したい！
コロナもだいぶ落ち着いてきて人と会う機会も増えてきました。
また、オンラインの環境も整備されてきておりそこでコミュニケーションを取る機会も増えてきていると思います。\n

しかし、どんな場であれやはり初対面は緊張するものです。
自己紹介だけではなんだか堅苦しく少し気まずくなってしまうこともあるでしょう（個人の感想です）。\n

**ぽいネ!** はこのような時に、円滑にコミュニケーションを行うためのきっかけづくりに向いています！
モノマネは無意識に羽目を外すことができるので、ぽいネ！で遊んでいるうちに緊張がほぐれてくると思います。
また、現在用意されている音源はかなり短いので、うまくできなきゃダメだと気負わず、気楽に遊ぶことができると思います！\n

短時間で一緒にいる人全員が楽しむことができるので、会議や研修前のアイスブレイクにも使えるかもしれません（対面でもオンラインでも！）。

---
## その2　音声学習に役立つアプリを作りたい！
「英語などの言語は小さいときから学んだ方がよい。」
皆さんもこんなことを聞いたことがあると思います。
小さいときは細かい音の違いに気づくことができますが、だんだんあまり聞かない音は聞きなじみのある音で捉えるようになってしまいます。\n

ですが、近年英語の需要が高まっているのに、小さい時から触れてないからという理由だけで諦めてしまうというのはもったいないですよね。
実は、第二言語の音声に対する識別能力は、低下はしますが可逆的なものであるため、もう手遅れだというわけではないのです。\n

この **ぽいネ!** ではいろんな音を聞く能力、そして、それを真似て発音する能力を鍛えることができます。
直接言語を学習することにつながるわけではないですが、音声学習のツールとして利用していただければと思います。
""")